# Set up and clean up of data frames

In [1]:
# Dependencies 
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [10]:
# Create a new data frame for MHI based on MHI.csv
median_household_income = pd.DataFrame(
    {"year": ["2015", "2016", "2017", "2018"],
     "mhi": [101133, 107075, 115908, 122930]
    }
)
median_household_income

   year     mhi
0  2015  101133
1  2016  107075
2  2017  115908
3  2018  122930

In [11]:
# Save data frame to CSV
median_household_income.to_csv("data/median_household_income.csv", index=False)

### calculate the percent change of MHI

In [101]:
# Calculate percent change for MHI
MHIpct_change = pd.DataFrame(
    {"mhi": [101133, 107075, 115908, 122930]},
     index = ["2015", "2016", "2017", "2018"]
)
MHIpct_change

         mhi
2015  101133
2016  107075
2017  115908
2018  122930

In [102]:
avg_percentMHI = MHIpct_change.pct_change()

avg_percentMHI

           mhi
2015       NaN
2016  0.058754
2017  0.082494
2018  0.060583

In [103]:
avg_percentMHI.iloc[[1,2,3]].mean()

mhi    0.067277
dtype: float64

## clean up of student data

In [88]:
# Read enrollment CSVs to get the count of students enrolled each year
demo_2015 = pd.read_csv("initialData/2015_demo_data.csv")
demo_2016 = pd.read_csv("initialData/2016_demo_data.csv")
demo_2017 = pd.read_csv("initialData/2017_demo_data.csv")
demo_2018 = pd.read_csv("initialData/2018_demo_data.csv")

In [89]:
#clean up of 2015 csv
demo_2015.head()

,student.studentNumber,mailingAddress.addressLine1,mailingAddress.addressLine2,mailingAddress.city,mailingAddress.state,mailingAddress.zip,student.raceEthnicity,student.startDate,student.endDate
0,111120061,151 Escanyo Dr,"So San Francisco, CA 94080",So San Francisco,CA,94080,400.0,08/12/2015,05/25/2016
1,111130092,222 Alta Vista Dr,"So San Francisco, CA 94080",So San Francisco,CA,94080,700.0,08/12/2015,05/25/2016
2,111130111,144 Country Club Dr #9,"So San Francisco, CA 94080",So San Francisco,CA,94080,700.0,08/12/2015,05/25/2016
3,111170029,512 Poplar Ave,"So San Francisco, CA 94080",So San Francisco,CA,94080,399.0,08/12/2015,05/25/2016
4,112080082,1 Wakefield Ave,"Daly City, CA 94015",Daly City,CA,94015,400.0,08/12/2015,05/25/2016

In [90]:
demo_2015 = demo_2015.rename(columns={"student.studentNumber":"student_id"})
demo_2015.head()

,student_id,mailingAddress.addressLine1,mailingAddress.addressLine2,mailingAddress.city,mailingAddress.state,mailingAddress.zip,student.raceEthnicity,student.startDate,student.endDate
0,111120061,151 Escanyo Dr,"So San Francisco, CA 94080",So San Francisco,CA,94080,400.0,08/12/2015,05/25/2016
1,111130092,222 Alta Vista Dr,"So San Francisco, CA 94080",So San Francisco,CA,94080,700.0,08/12/2015,05/25/2016
2,111130111,144 Country Club Dr #9,"So San Francisco, CA 94080",So San Francisco,CA,94080,700.0,08/12/2015,05/25/2016
3,111170029,512 Poplar Ave,"So San Francisco, CA 94080",So San Francisco,CA,94080,399.0,08/12/2015,05/25/2016
4,112080082,1 Wakefield Ave,"Daly City, CA 94015",Daly City,CA,94015,400.0,08/12/2015,05/25/2016

In [91]:
# Change the type of "student_id" to string
demo_2015["student_id"] = demo_2015["student_id"].astype(str)

In [92]:
# get the enrollment count for each year

count_2015 = demo_2015["student_id"].nunique()
count_2016 = demo_2016["student_id"].nunique()
count_2017 = demo_2017["student_id"].nunique()
count_2018 = demo_2018["student_id"].nunique()

print(count_2015, count_2016, count_2017, count_2018)

9357 9260 9133 8887

In [3]:
# Create a new data frame for enrollment counts 

enrollment_count = pd.DataFrame(
    {"school_year": ["2015-2016", "2016-2017", "2017-2018", "2018-2019"],
     "students_enrolled": [9357, 9260, 9133, 8887]
     }
)

enrollment_count

  school_year  students_enrolled
0   2015-2016               9357
1   2016-2017               9260
2   2017-2018               9133
3   2018-2019               8887

In [4]:
# Save data frame to CSV
enrollment_count.to_csv("data/enrollment_count.csv", index=False)

### Calculate percent change for MHI

In [70]:
# Calculate percent change for MHI
studentCount_pctChange = pd.DataFrame(
    {"studentsEnrolled": [9357, 9260, 9133, 8887]},
     index =  ["2015-2016", "2016-2017", "2017-2018", "2018-2019"]
)

studentCount_pctChange

           studentsEnrolled
2015-2016              9357
2016-2017              9260
2017-2018              9133
2018-2019              8887

In [81]:
# percent change
avg_percent = studentCount_pctChange.pct_change()
avg_percent

           studentsEnrolled
2015-2016               NaN
2016-2017         -0.010367
2017-2018         -0.013715
2018-2019         -0.026935

In [82]:
# average percent change
avg_percent.iloc[[1,2,3]].mean()

studentsEnrolled   -0.017006
dtype: float64

# Loading CSVs to database

In [7]:
connection_string = "postgres:marlata1@localhost:5432/MHIvsEnrollmentCount"
engine = create_engine(f'postgresql://{connection_string}')

In [8]:
engine.table_names()

['median_household_income', 'enrollment_count']

In [12]:
median_household_income.to_sql(name='median_household_income', con=engine, if_exists='append', index=False)
enrollment_count.to_sql(name='enrollment_count', con=engine, if_exists='append', index=False)

In [13]:
pd.read_sql_query('select * from median_household_income', con=engine)

   year     mhi
0  2015  101133
1  2016  107075
2  2017  115908
3  2018  122930

In [15]:
pd.read_sql_query('select * from enrollment_count', con=engine)

  school_year  students_enrolled
0   2015-2016               9357
1   2016-2017               9260
2   2017-2018               9133
3   2018-2019               8887